experiments/results/baseline-jaeger/raw/20260623_224404_compose-post_R1000_t4_c40_d60.txt
# workload=compose-post
# rate=1000
# threads=4
# connections=40
# duration=60
# timestamp=20260623_224404

Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 40 connections

  Thread calibration: mean lat.: 5.921ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 5.613ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.738ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 5.687ms, rate sampling interval: 17ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.02ms    5.88ms  30.06ms   91.59%
    Req/Sec   256.65    123.61   588.00     66.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.31ms
 75.000%    7.68ms
 90.000%   11.98ms
 99.000%   30.06ms
 99.900%   73.41ms
 99.990%  114.56ms
 99.999%  131.33ms
100.000%  131.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.589     0.000000            1         1.00
       3.547     0.100000         5013         1.11
       3.935     0.200000         9982         1.25
       4.327     0.300000        15013         1.43
       4.771     0.400000        19982         1.67
       5.307     0.500000        24951         2.00
       5.623     0.550000        27453         2.22
       6.003     0.600000        29942         2.50
       6.463     0.650000        32430         2.86
       7.015     0.700000        34924         3.33
       7.683     0.750000        37410         4.00
       8.123     0.775000        38668         4.44
       8.631     0.800000        39904         5.00
       9.199     0.825000        41152         5.71
       9.943     0.850000        42407         6.67
      10.823     0.875000        43647         8.00
      11.383     0.887500        44272         8.89
      11.975     0.900000        44900        10.00
      12.711     0.912500        45516        11.43
      13.583     0.925000        46143        13.33
      14.655     0.937500        46763        16.00
      15.279     0.943750        47080        17.78
      15.975     0.950000        47388        20.00
      16.799     0.956250        47698        22.86
      17.791     0.962500        48011        26.67
      19.055     0.968750        48321        32.00
      19.839     0.971875        48480        35.56
      20.815     0.975000        48636        40.00
      21.999     0.978125        48790        45.71
      23.583     0.981250        48946        53.33
      25.183     0.984375        49100        64.00
      26.351     0.985938        49178        71.11
      27.423     0.987500        49257        80.00
      29.055     0.989062        49334        91.43
      30.911     0.990625        49412       106.67
      32.959     0.992188        49490       128.00
      34.175     0.992969        49530       142.22
      35.647     0.993750        49568       160.00
      37.695     0.994531        49607       182.86
      39.455     0.995313        49647       213.33
      42.143     0.996094        49686       256.00
      43.263     0.996484        49705       284.44
      45.823     0.996875        49724       320.00
      47.935     0.997266        49743       365.71
      51.359     0.997656        49763       426.67
      56.671     0.998047        49782       512.00
      58.655     0.998242        49792       568.89
      61.567     0.998437        49802       640.00
      65.855     0.998633        49811       731.43
      69.503     0.998828        49822       853.33
      75.263     0.999023        49831      1024.00
      78.719     0.999121        49836      1137.78
      79.999     0.999219        49841      1280.00
      81.599     0.999316        49845      1462.86
      88.511     0.999414        49850      1706.67
      91.839     0.999512        49855      2048.00
      93.695     0.999561        49859      2275.56
      94.591     0.999609        49860      2560.00
      96.767     0.999658        49862      2925.71
     100.351     0.999707        49865      3413.33
     101.631     0.999756        49867      4096.00
     105.087     0.999780        49870      4551.11
     105.087     0.999805        49870      5120.00
     105.343     0.999829        49871      5851.43
     110.719     0.999854        49872      6826.67
     114.239     0.999878        49873      8192.00
     114.559     0.999890        49874      9102.22
     120.127     0.999902        49875     10240.00
     120.127     0.999915        49875     11702.86
     123.199     0.999927        49876     13653.33
     123.199     0.999939        49876     16384.00
     128.063     0.999945        49877     18204.44
     128.063     0.999951        49877     20480.00
     128.063     0.999957        49877     23405.71
     129.279     0.999963        49878     27306.67
     129.279     0.999969        49878     32768.00
     129.279     0.999973        49878     36408.89
     129.279     0.999976        49878     40960.00
     129.279     0.999979        49878     46811.43
     131.327     0.999982        49879     54613.33
     131.327     1.000000        49879          inf
#[Mean    =        7.023, StdDeviation   =        5.882]
#[Max     =      131.200, Total count    =        49879]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  59799 requests in 1.00m, 12.26MB read
Requests/sec:    996.52  
Transfer/sec:    209.23KB

# docker compose ps
NAME                                     IMAGE                                                COMMAND                  SERVICE                  CREATED        STATUS             PORTS
socialnetwork-compose-post-service-1     deathstarbench/social-network-microservices:latest   "ComposePostService"     compose-post-service     11 hours ago   Up About an hour   
socialnetwork-home-timeline-redis-1      redis                                                "docker-entrypoint.s…"   home-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-home-timeline-service-1    deathstarbench/social-network-microservices:latest   "HomeTimelineService"    home-timeline-service    11 hours ago   Up About an hour   
socialnetwork-jaeger-agent-1             jaegertracing/all-in-one:1.62.0                      "/go/bin/all-in-one-…"   jaeger-agent             11 hours ago   Up About an hour   4317-4318/tcp, 5775/udp, 5778/tcp, 9411/tcp, 14250/tcp, 14268/tcp, 6831-6832/udp, 0.0.0.0:16686->16686/tcp, [::]:16686->16686/tcp
socialnetwork-media-frontend-1           yg397/media-frontend:xenial                          "/usr/local/openrest…"   media-frontend           11 hours ago   Up About an hour   0.0.0.0:8081->8080/tcp, [::]:8081->8080/tcp
socialnetwork-media-memcached-1          memcached                                            "docker-entrypoint.s…"   media-memcached          11 hours ago   Up About an hour   11211/tcp
socialnetwork-media-mongodb-1            mongo:4.4.6                                          "docker-entrypoint.s…"   media-mongodb            11 hours ago   Up About an hour   27017/tcp
socialnetwork-media-service-1            deathstarbench/social-network-microservices:latest   "MediaService"           media-service            11 hours ago   Up About an hour   
socialnetwork-nginx-thrift-1             yg397/openresty-thrift:xenial                        "/usr/local/openrest…"   nginx-thrift             11 hours ago   Up About an hour   0.0.0.0:8080->8080/tcp, [::]:8080->8080/tcp
socialnetwork-post-storage-memcached-1   memcached                                            "docker-entrypoint.s…"   post-storage-memcached   11 hours ago   Up About an hour   11211/tcp
socialnetwork-post-storage-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   post-storage-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-post-storage-service-1     deathstarbench/social-network-microservices:latest   "PostStorageService"     post-storage-service     11 hours ago   Up About an hour   0.0.0.0:10002->9090/tcp, [::]:10002->9090/tcp
socialnetwork-social-graph-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   social-graph-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-social-graph-redis-1       redis                                                "docker-entrypoint.s…"   social-graph-redis       11 hours ago   Up About an hour   6379/tcp
socialnetwork-social-graph-service-1     deathstarbench/social-network-microservices:latest   "SocialGraphService"     social-graph-service     11 hours ago   Up About an hour   
socialnetwork-text-service-1             deathstarbench/social-network-microservices:latest   "TextService"            text-service             11 hours ago   Up About an hour   
socialnetwork-unique-id-service-1        deathstarbench/social-network-microservices:latest   "UniqueIdService"        unique-id-service        11 hours ago   Up About an hour   
socialnetwork-url-shorten-memcached-1    memcached                                            "docker-entrypoint.s…"   url-shorten-memcached    11 hours ago   Up About an hour   11211/tcp
socialnetwork-url-shorten-mongodb-1      mongo:4.4.6                                          "docker-entrypoint.s…"   url-shorten-mongodb      11 hours ago   Up About an hour   27017/tcp
socialnetwork-url-shorten-service-1      deathstarbench/social-network-microservices:latest   "UrlShortenService"      url-shorten-service      11 hours ago   Up About an hour   
socialnetwork-user-memcached-1           memcached                                            "docker-entrypoint.s…"   user-memcached           11 hours ago   Up About an hour   11211/tcp
socialnetwork-user-mention-service-1     deathstarbench/social-network-microservices:latest   "UserMentionService"     user-mention-service     11 hours ago   Up About an hour   
socialnetwork-user-mongodb-1             mongo:4.4.6                                          "docker-entrypoint.s…"   user-mongodb             11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-service-1             deathstarbench/social-network-microservices:latest   "UserService"            user-service             11 hours ago   Up About an hour   
socialnetwork-user-timeline-mongodb-1    mongo:4.4.6                                          "docker-entrypoint.s…"   user-timeline-mongodb    11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-timeline-redis-1      redis                                                "docker-entrypoint.s…"   user-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-user-timeline-service-1    deathstarbench/social-network-microservices:latest   "UserTimelineService"    user-timeline-service    11 hours ago   Up About an hour